
#1=#2604 //X左右方向探测最大行程
#2=2605 //Y上下方向探测最大行程



//X轴探测开始
#10=#1*1 //X正方向探测极限
#11=0
#12=0
#13=0
#14=0
#15=0
#16=#2606 //探测速度 mm/min
#17=#2607  //端口号
#18=#2608   //有效电平
#19=0
#20=0


G53 Z#2600  //移动Z安全高度

G53 X#2601 Y#2602 //XY 移动刀扫描起点
G53 Z#2603   //Z移动到扫描起点

#5=#880 //记录当前X机械坐标
#6=#881 //记录当前Y机械坐标


G91G31X#10Y#11Z#12A#13B#14C#15 F#16 P#17 L#18 K#19 Q#20
#3 = #1925 //记录当前X机械坐标
G91 G00 X[#5-#1925] F1000 //回到X起点


#10=#1*[-1] //X负方向探测极限
G91G31X#10Y#11Z#12A#13B#14C#15 F#16 P#17 L#18 K#19 Q#20
#4 = #1925  //记录当前X机械坐标
G91 G00 X[#5-#1925] F1000 //回到X起点

#805=[#3+#4]/2  //设置X轴G54偏置
//X轴探测结束


//Y轴探测开始
#10=0 
#11=#2*1  //Y正方向探测极限
#12=0
#13=0
#14=0
#15=0
#16=100 //探测速度 mm/min
#17=24  //端口号
#18=0   //有效电平
#19=0
#20=0
G91G31X#10Y#11Z#12A#13B#14C#15 F#16 P#17 L#18 K#19 Q#20
#3 = #1926 //记录当前Y机械坐标
G91 G00 Y[#6-#1926] F1000 //回到Y起点


#11=#2*[-1] //Y负方向探测极限
G91G31X#10Y#11Z#12A#13B#14C#15 F#16 P#17 L#18 K#19 Q#20
#4 = #1926  //记录当前Y机械坐标
G91 G00 Y[#6-#1926] F1000 //回到Y起点

#806=[#3+#4]/2  //设置Y轴G54偏置
//Y轴探测结束

G90 G00 X0 Y0  //移动到中心位置












